emacs/emacs-build.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building Emacs from Source</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Building Emacs from Source</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org008d1f4">1. Cloning Emacs Source</a></li>
<li><a href="#orgb636d59">2. Quick Start</a></li>
</ul>
</div>
</div>


<div id="outline-container-org008d1f4" class="outline-2">
<h2 id="org008d1f4"><span class="section-number-2">1.</span> Cloning Emacs Source</h2>
<div class="outline-text-2" id="text-1">
<p>
Cloning from <a href="https://git.savannah.gnu.org/git/emacs.git">GNU Savvanah</a> is slow as hell, so just use <a href="https://github.com/emacs-mirror/emacs.git">Github mirror</a>.
</p>
</div>
</div>

<div id="outline-container-orgb636d59" class="outline-2">
<h2 id="orgb636d59"><span class="section-number-2">2.</span> Quick Start</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/emacs-mirror/emacs.git
<span class="org-builtin">cd</span> emacs

./autogen.sh                                    <span class="org-comment-delimiter"># </span><span class="org-comment">Generate configure script
</span>./configure                                             <span class="org-comment-delimiter"># </span><span class="org-comment">Detect system configuration
</span>make                                                    <span class="org-comment-delimiter"># </span><span class="org-comment">Build emacs
</span>src/emacs                                               <span class="org-comment-delimiter"># </span><span class="org-comment">Test emacs executable file
</span>make install                                    <span class="org-comment-delimiter"># </span><span class="org-comment">Install emacs globally</span>
</pre>
</div>
</div>
</div>
</main>
</body>
</html>
